## Encoding categorical features  
Categorical features are non-numeric features with a limited amount of possible options

Before feeding them into most machine-learning algorithms we must convert them into numerical features using either:
- **Label endocing:** Each unique category is assigned to a numerical value: 0, 1, 2, 3 ...
- **One-hot encoding:** A new binary feature ius created for each category

In [3]:
import pandas as pd
import seaborn as sns

In [6]:
titanic = sns.load_dataset("titanic")
titanic.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [7]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [30]:

cat_columns = [col for col in titanic.columns if titanic[col].dtype in ["object", "category"]]

cat_columns

['sex', 'class', 'who', 'embark_town', 'alive']

In [31]:
df_categories = titanic[cat_columns]
df_categories.head(5)

      sex  class    who  embark_town alive
0    male  Third    man  Southampton    no
1  female  First  woman    Cherbourg   yes
2  female  Third  woman  Southampton   yes
3  female  First  woman  Southampton   yes
4    male  Third    man  Southampton    no

In [32]:
for cat in cat_columns:
    print(f"{cat}: {df_categories[cat].unique()}")

sex: ['male' 'female']
class: ['Third', 'First', 'Second']
Categories (3, object): ['First', 'Second', 'Third']
who: ['man' 'woman' 'child']
embark_town: ['Southampton' 'Cherbourg' 'Queenstown' nan]
alive: ['no' 'yes']

### Label encoding  
Label encoding maps each category into a numerical value.

Use label encoding if: 
- Categories have a natural order
- There are only two categories
- Using One-hot encoding leads to a large number of features

In [52]:
# Manual mapping

titanic["embark_town"] = titanic["embark_town"].map({"Southampton" : 0, "Cherbourg" : 1, "Queenstown" : 2})

#### Auto-mapping using Label Encoder from Scikit-lear

In [48]:
# Use pipenv to install scikit-learn, to install package.
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

titanic["deck"] = le.fit_transform(titanic["deck"])

titanic["deck"].head()

0    7
1    2
2    7
3    2
4    7
Name: deck, dtype: int64

### One-hot encoding
In one-hot encoding, a new binary feature is created for each category, and the value of that feature
is set to 1 if the observation belongs to that category, and 0 otherwise.

Use one-hot ancoding if: 
- Categories have no natural order.
- Numbers of categories are small (but not 2)

In [64]:
# titanic.drop(columns="deck_no", inplace=True)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,class,adult_male,deck,embark_town,alive,alone,who_child,who_man,who_woman
0,0,3,1,22.0,1,0,7.2500,2,1,7,0.0,0,0,0,1,0
1,1,1,0,38.0,1,0,71.2833,0,0,2,1.0,1,0,0,0,1
2,1,3,0,26.0,0,0,7.9250,2,0,7,0.0,1,1,0,0,1
3,1,1,0,35.0,1,0,53.1000,0,0,2,0.0,1,0,0,0,1
4,0,3,1,35.0,0,0,8.0500,2,1,7,0.0,0,1,0,1,0

In [ ]:
titanic = pd.get_dummies(data=titanic, columns=["who"])

### Auto-map remaining

In [62]:
cat_columns = [col for col in titanic.columns if titanic[col].dtype in ["object", "category", "bool"]]
cat_columns

['sex',
 'class',
 'adult_male',
 'alive',
 'alone',
 'who_child',
 'who_man',
 'who_woman']

In [63]:
for column in cat_columns: 
    titanic[column] = le.fit_transform(titanic[column])